package Seminars.Seminar_04;
/*===========================================================================
* Реализовать консольное приложение, которое принимает строки и запоминает их.
* Если введено print, то нужно вывести в консоль строки так,
* что последняя введеная является первой в списке
* Если введено revert, то удаляем последнюю введную строку
* Если введено exit, то завершаем программу
* java
* python
* c#
* print -> [c#, python, java]
* revert
* print -> [python, java]
===========================================================================*/
public class Task_01 {
}
