package Home_works.Additional_tasks;

public class Phonebook {
    /*=============================================================
        * Реализуйте струткутру телефонной книги с помощью HashMap.
        * Программа также должна учитывать, что во входной структуре
        * будут повторяющиеся имена с разными телефонами, их необходимо
        * считать, как одного человека с разными телеыонами.
        * Вывод должен быть отсортирован по убыванию числа телефонов.
        =============================================================*/
    public static class Task_01 {
    }
}
