package Home_works.Additional_tasks;
/*===============================================================================
* Объявлена доска 9х9. Необходимо отвалидировать в соответствии с правилами:
* 1. каждая строка должна содержать цифру 1-9 ьез повторения
* 2. каждая колонка должна содержать цифру 1-9 ьез повторения
* 3. каждый под блок из 9 элемнтов 3х3 должна содержать цифру 1-9 без повторения.
* Ограничения: board.length == 9
*              board[i].length == 9
*              board[i][j] значение число или '.'
* Пример:
* {'5','3','.','.','7','.','.','.','.'}
* {'6','.','.','1','9','5','.','.','.'}
* {'.','9','8','.','.','.','.','6','.'}
* {'8','.','.','.','6','.','.','.','3'}
* {'4','.','.','8','.','3','.','.','1'}
* {'7','.','.','.','2','.','.','.','6'}
* .....
===============================================================================*/
public class Task_02 {
}
