package Seminars.Seminar_01;

/*============================================================
* Задание №2
* Дан массив двоичных чисел, например [1,1,0,1,1,1,1], вывести
* максимальное количество подряд идущих 1.
* Найти максимальное количество подряд идущих одинаковых
* элементов массива. (постараться сделать с одним циклом)
============================================================*/
public class Task_02 {
    public static void main(String[] args) {
        int[] new_array = new int[]{1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1};

        int count = 0;
        int temp = 0;

        for (int item : new_array) {
            if (item == 1) {
                count++;
                if (temp < count) temp = count;
            } else count = 0;
        }

        System.out.println(temp);

    }
}
