package Home_works;

/*===========================================================================
* Учитывая строку s, содержащую только символы '(', ')', '{', '}', '[' и ']',
* определите, является ли входная строка допустимой.
* Входная строка действительна, если:
* 1. Открытые скобки должны закрываться скобками того же типа.
* 2. Открытые скобки должны закрываться в правильном порядке.
* 3. Каждой закрывающей скобке соответствует открытая скобка того же типа.
* Example 1:
* Input: s = "()"
* Output: true
*
* Example 2:
* Input: s = "()[]{}"
* Output: true
*
* Example 3:
* Input: s = "(]"
* Output: false
===========================================================================*/
public class Task_04 {
}
